app/controllers/projects_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = 1 AND "issues"."assigned_to_id" = 8
SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = 1 AND "issues"."tracker_id" = 4
SELECT "attachments".* FROM "attachments"
SELECT COUNT(DISTINCT "issues"."id") AS count_id, tracker_id AS tracker_id FROM "issues" LEFT OUTER JOIN "projects" ON "projects"."id" = "issues"."project_id" LEFT OUTER JOIN "issue_statuses" ON "issue_statuses"."id" = "issues"."status_id" WHERE (projects.status <> 9 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='issue_tracking')) AND (issue_statuses.is_closed = 'f') AND ((projects.id = 1 OR (projects.lft > 3 AND projects.rgt < 4))) GROUP BY tracker_id
SELECT COUNT(*) FROM "issues" WHERE "issues"."project_id" = 1 AND "issues"."status_id" = 1
---
  def show
    # try to redirect to the requested menu item
    if params[:jump] && redirect_to_project_menu_item(@project, params[:jump])
      return
    end


        # issues assigned to current user

        @issuesAssignedToMe = @project.issues.where assigned_to_id: User.current.id
        @myIssues = @issuesAssignedToMe.where tracker_id: 5
        @myIssues = @myIssues.where(status_id: [1,2])
        @myIssues = @myIssues.reverse

        # tasks assigned to current user

        @tasksAssignedToMe = @project.issues.where assigned_to_id: User.current.id
        @myTasks = @tasksAssignedToMe.where tracker_id: 4
        @myTasks = @myTasks.where(status_id: [1,2])
        @myTasks = @myTasks.reverse

        #@tasks = TodoList.all
        # files attaced to users
        @allFiles = Attachment.all.reverse


       @numberOfIssues =  @project.issues.count
       @numberOfOpenIssues =  @project.issues.where(status_id: [1,2])
       @openIssues = @numberOfOpenIssues.count

SELECT "users".* FROM "users" WHERE "users"."type" IN ('User', 'AnonymousUser') AND "users"."id" IN (8)
SELECT "news".* FROM "news" WHERE "news"."project_id" = 1 ORDER BY news.created_on DESC LIMIT 5
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1)
---
       @allFiles = @project.attachments.reverse

    @users_by_role = @project.users_by_role
    @subprojects = @project.children.visible.all
    @news = @project.news.limit(5).includes(:author, :project).reorder("#{News.table_name}.created_on DESC").all

SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."type" IN ('IssueCustomField') ORDER BY custom_fields.position ASC
SELECT "trackers".* FROM "trackers" ORDER BY trackers.position ASC
---
  def settings
    @issue_custom_fields = IssueCustomField.sorted.all
    @issue_category ||= IssueCategory.new
    @member ||= @project.members.new
    @trackers = Tracker.sorted.all